<?php
/**
 * Created by PhpStorm.
 * User: Екатерина
 * Date: 02.03.15
 * Time: 21:13
 */
$this->title = "О программе";
?>

<div class="content">
    <div class="col-md-12">
        <h3 class="t1">О программе</h3>
        <hr>
    </div>
    <div class="col-md-10 col-md-offset-1 info">
        <p>В настоящее время многие банки закрываются из-за нестабильности в экономической и политической жизни страны. Экономика претерпевает постоянные изменения, и любой скачок валюты может за ночь превратить человека в банкрота или же наоборот в миллионера. В связи с этим очень остро стала проблема прогнозирования того или иного курса валют.</p>
        <p>В мире около 200 стран, и практически у каждой из них своя валюта. Курсы валют берутся с сайтов различных стран, которые постоянно обновляются. Ежедневно национальные банки устанавливают курсы мировых валют к денежной единице любой страны. Это делается для того, чтобы выполнять финансовые операции, производить расчет государственных расходов и доходов, для организации расчетов и платежей государства с предприятиями и т.д. При этом на основе курсов валют на текущую дату, целесообразным является получение прогноза на будущее. Обычно участие человека является неотъемлемой частью такого процесса, однако саму процедуру можно автоматизировать.</p>
        <p>Было принято решение разработать web-приложение, которое прогнозировало бы курс валют на ближайшее время по максимально возможному количеству методов и находило оптимальный прогноз. Наиболее перспективными являются методы прогнозирования Хольта и Брауна, Винтерса, Бокса-Дженкинса, основанные на сглаживании, экспоненциальном сглаживании и скользящем среднем. Чтобы уменьшить риск получения неправильного прогноза, было предложено комбинировать различные прогнозные методы, так чтобы они учитывали недостатки друг друга.</p>
        <p>Данные методы были положены в основу программного комплекса, который обладает удобным интерфейсом, позволяет просматривать курсы различных валют относительно доллара, находить оптимальные прогнозы, анализировать полученные результаты, строить графики и выдавать рекомендации.</p>
        <p>Использование разработанного приложения позволяет спрогнозировать курсы валют. Система может быть полезна банковским сотрудникам при построении кредитной политики банка; людям, торгующим на рынке Форекс и т.д.</p>
    </div>
</div>