<?php
/**
 * Created by PhpStorm.
 * User: Екатерина
 * Date: 02.03.15
 * Time: 21:13
 */
$this->title = "О программе";
?>

<div class="content">
    <div class="col-md-12">
        <h3 class="t1">Про програму</h3>
        <hr>
    </div>
    <div class="col-md-10 col-md-offset-1 info">
        <p>На сьогоднішній день багато банків закриваються через нестабільність в економічному та політичному житті країни. Економіка зазнає постійних змін, і будь-який стрибок валютного курсу може за одну ніч перетворити людину на банкрута або, навпаки, на мільйонера. У зв’язку з цим проблема прогнозування того чи іншого курсу валют набула особливої гостроти.</p>

        <p>У світі існує близько 200 країн, і майже кожна з них має власну валюту. Курси валют публікуються на офіційних вебсайтах різних країн, які регулярно оновлюються. Щодня національні банки встановлюють курси світових валют щодо грошової одиниці конкретної країни. Це здійснюється для проведення фінансових операцій, розрахунку державних доходів і витрат, організації розрахунків та платежів держави з підприємствами тощо. На основі поточних курсів валют доцільним є отримання прогнозу на майбутнє. Зазвичай участь людини є невід'ємною частиною цього процесу, проте саму процедуру можна автоматизувати.</p>

        <p>Було прийнято рішення розробити веб-додаток, який би прогнозував курси валют на найближчий період, використовуючи максимально можливу кількість методів, і визначав оптимальний прогноз. Найперспективнішими є методи прогнозування Хольта і Брауна, Вінтерса, Бокса-Дженкінса, які базуються на згладжуванні, експоненціальному згладжуванні та ковзному середньому. Для зменшення ризику отримання неточного прогнозу запропоновано комбінувати різні прогнозні методи, що дозволяє враховувати недоліки кожного з них.</p>

        <p>Ці методи були покладені в основу програмного комплексу, який має зручний інтерфейс, дозволяє переглядати курси різних валют щодо долара США, визначати оптимальні прогнози, аналізувати отримані результати, будувати графіки та надавати рекомендації.</p>

        <p>Використання розробленого додатка дозволяє здійснювати прогнозування валютних курсів. Система може бути корисною працівникам банків при формуванні кредитної політики банку, особам, які торгують на ринку Форекс, тощо.</p>
     </div>
</div>